{
    "en": {
        "tech": [
            "Haskell (GHC)",
            "ANSI TUI",
            "CSV Parsing",
            "Functional Programming"
        ],
        "features": [
            "Premium ANSI TUI with box-drawing UI elements",
            "Secure authentication and role-based access logic",
            "Dynamic CSV-based tool inventory management",
            "Intelligent plot availability & conflict detection engine",
            "Automated harvest efficiency and worker performance tracking"
        ],
        "stack": {
            "language": "Haskell",
            "framework": "Native Purely Functional",
            "tools": [
                "Cabal",
                "GHC"
            ],
            "database": "Text-Based Hierarchy (.txt)"
        },
        "screenshots": [],
        "description": "An advanced agricultural ERP system that brings enterprise-level management to the terminal. Written in purely functional Haskell, it ensures side-effect-free logic for critical operations like date scheduling and plot availability analysis. The system features a robust CSV integration for large-scale tool imports, an intelligent conflict-detection engine for land allocation, and a premium ANSI-styled interface that transforms a standard console into a professional business workstation."
    },
    "es": {
        "tech": [
            "Haskell (GHC)",
            "Interfaz ANSI TUI",
            "Procesamiento CSV",
            "Programación Funcional"
        ],
        "features": [
            "Interfaz TUI Premium con elementos de dibujo de cajas",
            "Autenticación segura y lógica de acceso por roles",
            "Gestión de inventario de herramientas mediante CSV dinámico",
            "Motor inteligente de disponibilidad de parcelas y detección de conflictos",
            "Seguimiento automatizado de eficiencia de cosecha y desempeño de trabajadores"
        ],
        "stack": {
            "language": "Haskell",
            "framework": "Nativo Puramente Funcional",
            "tools": [
                "Cabal",
                "GHC"
            ],
            "database": "Jerarquía de Texto Plano (.txt)"
        },
        "screenshots": [],
        "description": "Un robusto sistema ERP agrícola que lleva la gestión de nivel empresarial a la terminal. Escrito en Haskell puramente funcional, garantiza una lógica libre de efectos secundarios para operaciones críticas como la programación de fechas y el análisis de disponibilidad de parcelas. El sistema cuenta con una integración de CSV para importaciones de herramientas a gran escala, un motor inteligente de detección de conflictos para la asignación de tierras y una interfaz ANSI premium que transforma la consola en una estación de trabajo profesional."
    }
}